---
kind: property
id: P:Autodesk.Revit.DB.Visual.Ceramic.CeramicPatternAmount
source: html/e906536b-405b-aa8c-a3db-8fb1e6c09887.htm
---
# Autodesk.Revit.DB.Visual.Ceramic.CeramicPatternAmount Property

The property labeled "Amount" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public static string CeramicPatternAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".